Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །དེ་དག་གིས་ཀྱང་མངོན་སུམ་དུ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ནི་དམུ་རྒོད་གདུལ་དཀའ་ཞིང་བསྲུང་དཀའ་བ་ལགས་ཏེ་དེར་བདག་ཅག་གིས་སེམས་བརྐམ་ཆགས་ཅན་དུ་གྱུར་པས།
en: They then said directly to the Blessed One, “Blessed One, the mind is wild, difficult to tame, and hard to control. At that time we were filled with craving, and so we failed to please the Blessed Thus-Gone One Kanakamuni.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་དེ་མ་མཉེས་པར་བགྱིས་ལགས་སོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས། ད་སླན་ཆད་རང་གི་སྲོག་ཀྱང་ཡོངས་སུ་གཏང་བར་འཚལ་གྱིས་སྡིག་པའི་ལས་ནི་མི་བགྱིད་དོ།
en: So henceforth, Blessed One, we will commit no negative actions, even if it means giving up our own lives.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཆོས་ཀྱི་གཏམ་གྱིས་དགའ་བ་བསྐྱེད་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གྲོགས་པོ་དག་ཁྱེད་དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་འདུས་པ་དང་པོའི་གྲངས་སུ་གཏོགས་པར་འགྱུར་རོ།
en: The Blessed One then gave them a Dharma message that brought them much joy, saying, “Friends, you will be counted among the Thus-Gone One Maitreya’s first assembly.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱ་མཚོ་ཆེན་པོར་སེམས་ཅན་གྱི་དོན་ཇི་སྙེད་བྱ་དགོས་པ་དེ་དག་ཐམས་ཅད་མཛད་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: At this point, the Blessed One, having completed all his necessary activities for the benefit of beings in the ocean, said to Nāga King Sāgara, “Nāga Lord, come forward.

source: ཀླུའི་བདག་པོ་ཚུར་ཤོག །ད་རང་མལ་ཆ་དང་སྟན་རྣམས་སྡུས་ཤིག །ད་ནི་རང་གི་གནས་སུ་འགྲོའོ།
en: Gather my seat and cushion. I am going back to my realm.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཞབས་འབྲིང་བ་དང་བཅས་པར་གདན་དེ་ལས་བཞེངས་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་ཕྱིར་ཡང་རིན་པོ་ཆེའི་ཐེམ་སྐས་རྣམས་ལས་བཀོད་པ་ཆེན་པོ་དང་། མཆོད་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་ཆེན་པོས་གཤེགས་ནས། མགུར་བསལ་ཏེ།
en: The Blessed One then rose from his seat with his attendants and departed from the ocean via the jeweled staircase along with the great assembly, accompanied by much veneration, and displaying the eminence of a buddha.

source: རྒྱ་མཚོའི་འགྲམ་དུ་གཞེས་སོ།
en: To the singing of song, he arrived at the shore of the ocean.

source: །དེ་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ལྷ་མོ་འོད་ལྡན་མས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་པ།
en: Luminous Maiden, an ocean goddess, then offered these verses of praise to the Blessed One:

source: སུམ་ཅུ་རྩ་གཉིས་མཚན་མངའ་ལྷ་དང་མིས་མཆོད་པ།
en: “You are venerated by gods and humans and possess the thirty-two marks.

source: །ལྷ་མིན་དབང་པོས་བསྙེན་བཀུར་མི་མཆོག་དེང་ཕྱག་འཚལ།
en: Supreme human, served by the lord of the asuras, today I prostrate to you.

source: །པད་མ་ལྟ་བུའི་སྤྱན་མངའ་ཞལ་རས་ཟླ་བ་འདྲ།
en: Your eyes are like lotuses and your face resembles the moon.

source: །དགེ་བའི་ཆོས་ཀྱིས་འཕགས་པ་བདེ་སྦྱིན་དེང་ཕྱག་འཚལ།
en: You are elevated by virtuous qualities and bestow bliss—today I prostrate to you.

source: །གཟུགས་མཆོག་སྟོན་པ་བསོད་ནམས་བརྒྱ་ཡི་མཚན་དང་ལྡན།
en: “Teacher whose perfect body bears the marks of much merit,

source: །ཡོན་ཏན་ཡེ་ཤེས་འཕགས་པ་རྣམ་འདྲེན་དེང་ཕྱག་འཚལ།
en: Noble guide of qualities and wisdom, today I prostrate to you.

source: །སྦྱིན་དང་དུལ་བས་འཕགས་པ་ཚུལ་ཁྲིམས་བཟང་པོ་བསྩོགས།
en: Ennobled by your generosity and gentleness, you amass excellent discipline.

source: །བཟོད་པའི་སྟོབས་ཀྱིས་འཕགས་པ་མི་མཆོག་དེང་ཕྱག་འཚལ།
en: Supreme human ennobled by the power of patience, today I prostrate to you.

source: །བརྩོན་འགྲུས་སྟོབས་ཀྱིས་བྱུང་བ་བསམ་གཏན་བློ་གྲོས་སྦྱངས།
en: “Arisen from the power of diligence, you trained in concentration and intelligence.

source: །ཤེས་རབ་མཁའ་མཚུངས་ཁྱོད་ལ་དེ་རིང་མགོས་ཕྱག་འཚལ།
en: Your insight equals the sky—today I bow my head to you.

source: །བྱམས་པས་སྙོམས་པའི་ཐུགས་ལྡན་ཐུགས་རྗེས་འགྲོ་ལ་གཟིགས།
en: Your heart is filled with love, and you look upon beings with compassion.

source: །འདྲེན་པ་ཐུགས་དགྱེས་རྟག་ཏུ་བཏང་སྙོམས་ཕ་རོལ་གཤེགས།
en: You delight the guides as you always abide in the perfection of equanimity.

source: །ཀ་ལ་པིང་ཀ་ལྟ་བུར་གསུང་སྙན་ཚངས་སྐད་སྟོན།
en: “Your voice resembles the kalaviṅka bird, revealing the speech of Brahmā.

source: །གསུང་སྙན་སྟོན་པ་ཁྱོད་ལ་དེ་རིང་མགོས་ཕྱག་འཚལ།
en: O teacher with your melodious voice, today I prostrate to you.

source: །བདུད་དཔུང་འཇོམས་པ་བདུད་སྟོབས་ངེས་པར་འཇོམས་མཛད་པ།
en: You have defeated the hordes of Māra and absolutely decimated Māra’s power.

source: །བྱང་ཆུབ་བརྟུལ་ཞུགས་སྒྲུབ་པ་སྲིད་གསུམ་སྲིད་པས་མཆོད།
en: Perfecting the discipline of awakening, the three realms of existence venerate you.

source: །དྲི་གསུམ་དྲི་མ་སྦྱོང་བ་རྣམ་ཐར་གསུམ་སྟོན་པ།
en: “You who have purified the three stains and teach the three liberations,

source: །འཇིག་རྟེན་གསུམ་གྲགས་ཁྱོད་ལ་དེ་རིང་མགོས་ཕྱག་འཚལ།
en: Famous throughout the three worlds, today I bow my head to you.

source: །བདེན་པའི་བརྟུལ་ཞུགས་བཟང་རྟོགས་རྟག་ཏུ་ཆོས་ཀྱིས་འཕགས།
en: Mastering the excellent conduct of truth, you are eternally elevated by Dharma.

source: །རྟག་ཏུ་དགོན་པ་སྤྱོད་ཡུལ་རྟག་ཏུ་ཡེ་ཤེས་སྦྱོང་།
en: Always protecting others, you always master wisdom.

source: །ཉོན་མོངས་དགྲ་འཇོམས་གཟི་བརྗིད་ལྷག་པར་གཟི་བསྐྱེད་པ།
en: “You defeated the enemy of the afflictions and arouse extraordinary awe.

source: །པད་མ་ལྟ་བུའི་སྤྱན་མངའ་དེང་ཁྱོད་མགོས་ཕྱག་འཚལ།
en: O lotus-like eyes, today I bow my head to you.

source: །ལྷུན་པོའི་རྩེ་འདྲ་དགོངས་པ་རྡོ་རྗེ་ལྟ་བུར་བརྟན།
en: Your realization is lofty like Mount Meru’s peak and stable like a vajra.

source: །དགོངས་པས་འདྲ་ཡོན་ཏན་རྒྱ་མཚོ་ཕྱག་འཚལ་ལོ།
en: With a mind like the earth filled with an ocean of qualities, I prostrate to you.

source: །འགྲོ་ལ་སྟོང་པ་སྟོན་པ་ཞི་གནས་ཕ་རོལ་ཕྱིན།
en: “O you who teach beings emptiness and perfect tranquility,

source: །རབ་ཏུ་ཞི་བའི་ཐུགས་ལྡན་ཁྱོད་ལ་སྐྱབས་སུ་མཆི།
en: You whose heart is always peaceful, in you I take refuge.

source: །བདུད་རྩི་དམ་པ་སྟོན་པ་འགྲོ་མིན་འགྲོ་བ་གཅོད།
en: O teacher of sublime nectar who eliminates unwanted destinies,

source: །ལྷ་དང་མིས་མཆོད་ཁྱོད་ལ་དེ་རིང་མགོས་ཕྱག་འཚལ།
en: To you who are venerated by both gods and humans, today I bow my head.

source: །ས་སྟེང་ལྷ་ཡུལ་གྲགས་པ་སྙན་དང་གྲགས་པ་འཕགས།
en: “You are renowned on Earth and in the heavens—O noble one, you are renowned.

source: །ཡོན་ཏན་རྒྱ་ཆེན་མི་ཟད་ཡོན་ཏན་འབྱུང་གནས་འདུད།
en: To such vast and inexhaustible qualities, source of such qualities—I bow!

source: །ཇི་སྐད་གསུངས་བཞིན་མཛད་ཅིང་ཇི་སྐད་མཛད་བཞིན་གསུང་།
en: You practice as you preach, and you preach as you practice,

source: །ཇི་སྐད་སྤྱོད་བཞིན་སྐུལ་བ་དེང་ཁྱོད་མགོས་ཕྱག་འཚལ།
en: Inspiring us to do as you practice and preach. Today I bow my head to you.

source: །རྒ་ཤི་གྲོལ་མཛད་སྨན་པ་འགྲོ་བས་བསྙེན་བཀུར་བ།
en: “O doctor who liberates from aging and death, one served by beings,

source: །ཐར་པའི་ལམ་སྟོན་ཁྱོད་ལ་དེ་རིང་མགོས་ཕྱག་འཚལ།
en: Teacher of the path of freedom, today I bow my head to you.

source: །རྒྱུ་ཡི་བྱེད་པ་རབ་སྟོན་ལྟ་བའི་མུན་པ་སེལ།
en: You teach the function of causes and dispel the darkness of views.

source: །ལམ་མཆོག་སྟོན་པ་རྒྱལ་བ་ཁྱོད་ལ་སྐྱབས་སུ་མཆི།
en: O teacher of the supreme path, Victor, I take refuge in you.

source: །རིན་ཆེན་སྦྱིན་པ་གཅིག་པུ་ཆོས་ཀྱི་དགའ་བ་གསུང་།
en: “Sole distributor of what is valuable, preaching the joy of Dharma,

source: །ས་འདྲའི་ཐུགས་ལྡན་ཁྱོད་ལ་བདག་ནི་སྐྱབས་སུ་མཆི།
en: In you, whose heart is like the earth, I take refuge.

source: །འདྲེན་པ་ཡོན་ཏན་རྒྱ་མཚོ་ཡོན་ཏན་ལས་བསྟོད་པའི།
en: O Guide whose ocean of qualities is worthy of praise, May my store of merit begin to resemble yours!”

source: །བདག་གིས་བསོད་ནམས་གང་ལགས་དེས་ནི་ཁྱོད་འདྲར་ཤོག །དེ་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ལྷ་མོ་འོད་ལྡན་མས་བཅོམ་ལྡན་འདས་ལ་དེ་སྐད་བསྟོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་སླར་བྱུང་སྟེ་གཤེགས་པས་ད་ནི་རྒྱ་མཚོ་ཆེན་པོ་མི་མཛེས་པ་ལགས་ན།
en: After Luminous Maiden, a goddess of the ocean, offered the Blessed One these verses of praise, she said, “Blessed One, since you have departed, the ocean is no longer as beautiful.

source: ཅི་ནས་བདག་རྒྱ་མཚོ་མཛེས་པར་བགྱིད་པ་དེ་ལྟ་བུར་བཅོམ་ལྡན་འདས་ཀྱིས་རྗེས་སུ་བསྟན་ན་ལེགས་སོ་ལེགས་སོ།
en: So please do teach me something so that I can beautify the ocean. That would be wonderful, absolutely wonderful.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱ་མཚོ་ཆེན་པོའི་ལྷ་མོ་འོད་ལྡན་མ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འོད་ལྡན་མ་ཆོས་བཅུ་པོ་འདི་དག་ནི་རྒྱན་དུ་འགྱུར་བ་ཡིན་ཏེ།
en: The Blessed One then said to Luminous Maiden, goddess of the ocean, “Luminous Maiden, these ten qualities will become adornments.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་བྱམས་པའི་རྗེས་སུ་འཇུག་པའི་སེམས་བསྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་མི་འཚེ་བར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་དང་། བསམ་པའི་སྦྱོར་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་སེམས་བསྐྱེད་པ་དགའ་བར་གནས་པ་དང་། སྦྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། རྣམ་པ་སྣ་ཚོགས་ཀྱི་རྒྱན་གྱི་སྨོན་ལམ་ལ་བརྩོན་འགྲུས་བརྟན་པ་དང་། དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་དྲན་པ་དང་། ཤེས་བཞིན་དུ་གནས་པ་དང་། སྔོན་གྱི་དགེ་བ་ཆུད་མི་ཟ་བའི་ཕྱིར་དང་། ཤེས་རབ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་དང་ལྡན་ཞིང་ཆོས་འདོད་པ་དང་། ཕན་པའི་དངོས་པོས་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོན་ཏན་ཐམས་ཅད་སྐྱེད་པ་དང་། གཉིས་སུ་མེད་པས་གོང་དུ་ཁྱད་པར་རྟོགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཐུགས་སུ་ཆུད་པ་ལ་ཡང་དག་པར་གཞོལ་བས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འཐོབ་པ་སྟེ།
en: They are arousing a loving mind for the sake of perfecting the path of the ten virtuous actions, practicing great compassion for the sake of not harming any being, practicing joy that causes the mind to direct one’s intentions to unsurpassed and perfect awakening, performing all forms of giving, having stable diligence in making aspirations that create diverse ornaments, practicing mindfulness and awareness for the sake of perfecting all the roots of virtue, possessing and desiring the Dharma so that one’s previous virtues do not go to waste and so that one perfects insight, using beneficial things to arouse all manner of positive qualities in all beings, gaining deepening realization of nonduality, and achieving recollection of the Buddha through applying oneself to what the Buddha has mastered.

source: འོད་ལྡན་མ་ཆོས་བཅུ་པོ་དེ་དག་ནི་རྒྱན་དུ་འགྱུར་བ་ཡིན་ནོ།
en: Luminous Maiden, these ten qualities will become adornments.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། རྒྱ་མཚོ་ཆེན་པོའི་ལྷ་མོ་འོད་ལྡན་མ་ལྷ་མོ་ཁྲི་དང་ལྷན་ཅིག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: Then Luminous Maiden, goddess of the ocean, along with ten thousand goddesses, developed the mind set on unsurpassed and perfect awakening.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོའི་རྒྱན་ལགས་སོ།
en: She then said to the Blessed One, “Blessed One, they are indeed ornaments of the ocean.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སེམས་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྒྱན་ལགས་ན། རྒྱ་མཚོ་ཆེན་པོ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ།
en: Blessed One, if the mind set on awakening is an ornament of all the worlds of the great trichiliocosm, why even mention the ocean?

source: བྱང་ཆུབ་ཀྱི་སེམས་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་བརྒྱན་པའི་སླད་དུ་བདག་ཅག་གིས་བསྐྱེད་ལགས་སོ།
en: Thus, in order to adorn every buddha realm, we have developed the mind set on awakening.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཞུགས་ཀྱང་རུང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་རུང་སྟེ། བདག་ནི་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་གནས་བཞིན་དུ་དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བའི་སླད་དུ་རྟག་ཏུ་བརྩོན་པ་ཁོ་ནར་འཚལ་ལོ།
en: Whether the Blessed Thus-Gone One lives or has passed into parinirvāṇa, as long as we live in the ocean, we commit to constantly exerting ourselves for the sake of protecting the sublime Dharma.

source: །བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་དུ་གཤེགས་པ་ན་ཡང་བཀོད་པ་ཐམས་ཅད་ཉེ་བར་བསྟན་པར་འཚལ་ལོ།
en: Blessed One, whenever you go to a village, we commit to revealing this entire display.

source: །ཆོས་ཀྱི་འབེལ་བའི་གཏམ་མཛད་པ་ན་ཡང་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་སྒྲུབ་པར་འཚལ་ལོ།
en: Whenever you deliver a Dharma lecture, we commit to manifesting the array in the courtyard.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་ལྡན་མ་འདི་ལྟར་ཁྱོད་ཀྱིས་ནི་སངས་རྒྱས་ཁྲི་ལ་མཆོད་པ་བྱས་སོ།
en: The Blessed One responded, “Luminous Maiden, in the same way, you have previously venerated ten thousand buddhas.

source: །འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་ཡང་བསྟན་ཏོ། །དམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་བསྲུངས་སོ། །འོད་ལྡན་མ་ཁྱོད་ནི་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཡང་མཆོད་པ་བྱེད་པར་འགྱུར་རོ། །དམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་བསྲུང་བར་འགྱུར་རོ།
en: You also manifested the array in their courtyard and protected their sublime Dharma.

source: །ཁྱོད་ནི་བསྐལ་པ་བཟང་པོ་འདི་འདས་པའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བར་སྐྱེ་བར་འགྱུར་ཏེ། བུད་མེད་ཀྱི་དངོས་པོ་བརྗེས་ནས་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་འགྱུར་རོ།
en: After this Fortunate Eon has passed, you will take rebirth in the Thus-Gone One Akṣobhya’s buddha realm, Abhirati, where you will exchange the attributes of a woman and achieve the attributes of a man.

source: །ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རོ།
en: You will be prophesied to unsurpassed and perfect awakening by the Thus-Gone One Akṣobhya.”

source: །དེ་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ལྷ་མོ་འོད་ལྡན་མས་བཅོམ་ལྡན་འདས་ལས་བདག་ཉིད་ཀྱི་ལུང་བསྟན་པ་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: When Luminous Maiden, goddess of the ocean, heard about this prophecy from the Blessed One, she was satisfied, pleased, delighted, and overjoyed.

source: རྒྱ་མཚོ་ཆེན་པོའི་རིན་པོ་ཆེ་དང་། རིན་ཐང་མཉམ་པའི་རིན་པོ་ཆེའི་ཕྲེང་བ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ནས་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: She adorned the Blessed One’s body with precious jewels and garlands of precious substances of similar value from the ocean. Joining her ten fingers and palms together, she spoke the following verses to the Blessed One:

source: །བདག་ནི་ཐུབ་པ་ཡེ་ཤེས་ཡོན་ཏན་ཀུན་གྱི་འབྱུང་གནས་དེ་ཡིས་ལུང་བསྟན་ཏེ།
en: “I will be prophesied by the Sage, who is the source of all wisdom and qualities.

source: །བདག་ནི་འདྲེན་པར་འགྱུར་བ་དག་ལ་ཡིད་གཉིས་ཐེ་ཙོམ་ཅི་ཡང་ཡོང་མ་མཆིས།
en: I will not doubt or hesitate at all about those who will be my guides.

source: །སྟོང་གསུམ་ས་གཞི་ཐམས་ཅད་རྣམ་པར་འགས་ཤིང་ཟླ་བ་ས་ལ་ལྷུང་ཡང་གདའ།
en: Though the ground of the trichiliocosm could split, and the moon could fall from the sky,

source: །ལྷ་ལས་ལྷག་པའི་ལྷས་མཆོད་སངས་རྒྱས་ཕྱིན་ཅི་ལོག་གི་ཚིག་གསུང་ཡོང་མི་གདའ།
en: The Buddha, venerated by the highest gods, could never speak mistaken words.

source: །བསམ་པ་བྱམས་པ་བརྩོན་འགྲུས་ཡུལ་ལ་ཐུགས་ནི་འཁྲུག་པར་འགྱུར་བ་མི་མངའ་ལྟོས།
en: “Look at how your mind’s loving intention is not disturbed by the tasks of diligence!

source: །བདག་ནི་སྟོང་པའི་ཡེ་ཤེས་ཡུལ་གྱི་ཆོས་རྣམས་དག་ལ་གུས་པར་བྱེད་ལ་ལྟོས།
en: Look at how I am respectful of the phenomena of the wisdom of emptiness!

source: །བདེ་བར་གཤེགས་པའི་ཡང་དག་སྤྱོད་པ་རྣམས་དང་ཡེ་ཤེས་ཐོགས་པ་མི་མངའ་ལྟོས།
en: Look at the authentic conduct of the Well-Gone One and his unimpeded wisdom!

source: །དེ་ཡིས་འདིར་ནི་བདག་གི་སེམས་ཀྱི་ཡུལ་བདེན་མཁྱེན་ནས་དེ་བཞིན་ལུང་ཡང་བསྟན།
en: Thus, knowing the truth of my mind’s objects, you accordingly gave prophecy.

source: །སྨོན་པ་རབ་མཆོག་བདེ་སྦྱིན་སྡུག་བསྔལ་ཀུན་ལས་གྲོལ་བར་མཛད་ལ་ཕྱག་འཚལ་ལོ།
en: “Homage to you who have highest aspirations, bring bliss, and liberate suffering.

source: །གནས་དང་སྐྱབས་དང་དཔུང་གཉེན་སྐྱོབ་པ་འཇིགས་པ་རྣམས་ལ་འཇིགས་མེད་སྦྱིན་མཛད་པ།
en: You are the locus, refuge, support, and protector, giving freedom from fear to the fearful.

source: །རྒྱལ་བ་ལམ་མཆོག་དམ་པ་སྟོན་མཛད་ལམ་ངན་ཡོངས་སུ་སྦྱོང་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to you, Victor who shows the sublime and perfect path and eliminates bad paths.

source: །འཇིག་རྟེན་རྣམ་པར་གཟིགས་ལ་མཁས་པ་འཇིག་རྟེན་འདས་པའི་འདྲེན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to you who see the world, who are learned, a guide who transcends the world.

source: །འདིར་ནི་ལྷ་དང་མི་རྣམས་གང་དག་སངས་རྒྱས་ཆོས་དང་ཚོགས་རྣམས་ཐོས་པ་དང་། །བྱང་ཆུབ་སྤྱོད་ཅིང་བྱང་ཆུབ་བསམ་པ་སེམས་པ་དེ་དག་རྙེད་པ་ལེགས་པར་རྙེད།
en: “All the gods and humans here have heard of the Buddha, Dharma, and Assembly And achieved, wonderfully attained, the conduct and intention of awakening.

source: །དེ་དག་ལ་ནི་ངན་འགྲོའི་འཇིགས་པ་མེད་དེ་མི་ཁོམ་བརྒྱད་ལས་ཡོངས་སུ་གྲོལ།
en: They are without fear of the lower realms and free of the eight unfavorable states.

source: །དེ་དང་དེ་དག་ལྷ་དང་མི་ཡི་བདེ་བ་ངེས་ཤིང་ཞི་བའི་གོ་འཕང་འཐོབ།
en: For them the happiness of gods and humans is certain, and they will achieve peace.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་མཐོང་དགས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ལགས་པ་མང་པོ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བགྱིས་ལགས་ན། གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་གནང་བ་མཛད་ན། བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཅུང་ཟད་ཙམ་འཚལ་ཏེ།
en: Priyadarśana , the son of the Nāga King Sāgara, then said to the Blessed One, “Blessed One, given that many gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans are venerating the Blessed One, if the Blessed One were to give me permission, I would commit to performing a small action in veneration of the Thus-Gone One.

source: བདག་གིས་བཅོམ་ལྡན་འདས་ཞབས་འབྲིང་བ་དང་བཅས་པར་རྣམ་པར་རྒྱལ་བྱེད་དང་འདྲ་བའི་བཀོད་པ་ཆེན་པོའི་ཁང་བཟངས་ཀྱི་ནང་དུ་བཞུགས་པར་གསོལ་ལ། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བསྐྱལ་བར་འཚལ་ལོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: I would ask the Blessed One to rest in a mansion set up like the Vaijayanta Palace with servants, which we would then carry to Vulture Peak Mountain.”

source: རིགས་ཀྱི་བུ་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སྐྱོལ་ཅིག །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་མཐོང་དགས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་རྣམ་པར་རྒྱལ་བྱེད་དང་འདྲ་བའི་ཁང་བཟངས་བྱིན་གྱིས་བརླབས་ནས།
en: The Blessed One responded, “Noble child, if you see that the time is right, carry me there.” Through the power of the Buddha and his own miraculous abilities, Nāga King Sāgara’s son Priyadarśana then conjured a mansion like the Vaijayanta Palace and installed the Blessed One there with servants.

source: དེར་བཅོམ་ལྡན་འདས་ཞབས་འབྲིང་དང་བཅས་པར་བཞུགས་པར་གསོལ་ནས་སྟེང་གི་བར་སྣང་ལས་གཤེགས་ཏེ། ཀླུའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་སིལ་སྙན་བྱེད་ཕེག་རྡོབ། གླུ་དབྱངས་ལེན་ཅིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་འབེབས་ལ། ལྷའི་སྤོས་དང་ཕྱེ་མ་སྣ་ཚོགས་ཀྱི་ཆར་འབེབས་བཞིན་དུ་མཐར་གྱིས་བཅོམ་ལྡན་འདས་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་བསྐྱལ་ཏོ། །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་བུ་དང་བཅས།
en: It then rose into the air, and while eighty-four thousand nāga girls played instruments, sang songs, and cast down a rain of flowers, myriad divine incense, and powders, the Blessed One was gradually carried to Vulture Peak Mountain.

source: ཆུང་མ་དང་གཡོག་འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས་བཅོམ་ལྡན་འདས་ལ་བཟོད་པ་གསོལ་ཏེ།
en: Nāga King Sāgara and his children, wives, and servants then touched the Blessed One’s feet and begged the Blessed One’s forgiveness:

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་མ་འབྱོར་བར་གྱུར་པ་གང་ལགས་པ་རྣམས་བདག་ཅག་ལ་བཟོད་པ་མཛད་དུ་གསོལ།
en: “Blessed One, please forgive us for any way in which we did not serve you correctly.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why do we ask this?

source: བཅོམ་ལྡན་འདས་རིན་པོ་ཆེ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་དང་འཚམ་པའི་མཆོད་པའི་འོས་ལགས་ལ།
en: Blessed One, it is appropriate to venerate you with every kind of jewel that there is.

source: བཅོམ་ལྡན་འདས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བླ་ན་མ་མཆིས་པའི་བསོད་ནམས་ཀྱི་ཞིང་རིན་པོ་ཆེ་ལགས་ཏེ། མཆོད་པའི་འོས་ལགས་ན།
en: The Blessed One is a precious and unsurpassed merit field for all beings, and it is fitting that he is venerated.

source: དེ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་འབྱོར་པའམ། ཡོངས་སུ་རྫོགས་པར་བགྱིད་པའི་རྔོ་མི་ཐོགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་དེ་ཙམ་ཚད་མ་མཆིས་པའི་མཆོད་པའི་འོས་ལགས་པའི་སླད་དུའོ།
en: Yet we are unable to provide or gather all that all beings in all the worlds of the great trichiliocosm have, even though the Thus-Gone One is worthy of such unlimited veneration. That is why we ask for your forgiveness.

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བགྱིད་པ་ལགས།
en: Blessed One, moreover, how should bodhisattvas venerate the Thus-Gone One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནན་ཏན་བྱེད་པས་དེ་བཞིན་གཤེགས་པ་ཇི་ལྟར་མཆོད་པ་ཉོན་ཅིག །བསམ་པ་རྣམ་པར་དག་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ།
en: The Blessed One answered, “Nāga Lord, listen to how bodhisattvas should earnestly venerate the Thus-Gone One.

source: བཅོས་མ་མ་ཡིན་པ་དང་གཡོ་མེད་པའི་ཕྱིར་རོ།
en: Purity of intention is veneration of the Thus-Gone One because it is not contrived or deceptive.

source: །ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་ལྷག་པར་དམིགས་པའི་ཕྱིར་རོ།
en: Purity of motivation is veneration of the Thus-Gone One because it takes aim at all roots of virtue.

source: །ཞེ་འགྲས་པ་མེད་པའི་སེམས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པའི་ཕྱིར་རོ།
en: The mind without aggression is veneration of the Thus-Gone One because it has an equanimous attitude toward all beings.

source: །ཚུལ་འཆོས་པ་དང་། ཁ་གསག་ཐམས་ཅད་རྣམ་པར་སྤངས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། སྤྱོད་ལམ་ཡོངས་སུ་དག་པའི་ཕྱིར་རོ།
en: Abandoning hypocrisy and flattery are veneration of the Thus-Gone One because they are pure conduct.

source: །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་སླུ་བའི་ཕྱིར་རོ།
en: Practicing what one preaches is veneration of the Thus-Gone One because it does not deceive the world.

source: །འཕགས་པའི་རིགས་ཀྱིས་ཆོག་པར་འཛིན་ཅིང་སྦྱངས་པའི་ཡོན་ཏན་ཐམས་ཅད་ཡང་དག་པར་བླངས་པ་མི་འདོར་བ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། དམ་བཅས་པ་ལ་བརྟན་པའི་ཕྱིར་རོ།
en: Satisfaction with the family of noble ones and not giving up the qualities of training that one has adopted are veneration of the Thus-Gone One because they are steadfast in their resolve.

source: །དབེན་པ་ལ་དགའ་ཞིང་བྲེ་མོའི་གཏམ་ཡོངས་སུ་སྤངས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། སེམས་ཡོངས་སུ་འདུལ་བའི་ཕྱིར་རོ།
en: Delighting in solitude and spurning gossip are veneration of the Thus-Gone One because they tame the mind.

source: །ཇི་སྐད་ཐོས་པའི་ཆོས་ལ་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་པའི་ཕྱིར་རོ།
en: Contemplation in accordance with what one has heard is veneration of the Thus-Gone One because it yields understanding that is accurate.

source: །བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། གསོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པར་ཉེ་བར་རྟོགས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ།
en: Realization of the absence of self, a being, a life principle, a soul, and personhood is veneration of the Thus-Gone One because they are primordially unarisen.

source: གཟོད་མ་ནས་མ་བྱུང་བའི་ཕྱིར་རོ། །སྟོང་པའི་ཆོས་ལ་འཇུག་པ་དང་། མཚན་མ་མེད་པ་ལ་ངེས་པར་རྟོགས་པ་དང་སྨོན་པ་དང་བྲལ་བ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། རྣམ་པར་ཐར་པའི་སྒོ་མངོན་སུམ་དུ་བྱེད་པའི་ཕྱིར་རོ།
en: Understanding empty phenomena, realizing the absence of marks, and being free from wishes are veneration of the Thus-Gone One because they actualize the gateways of liberation.

source: །རྐྱེན་འདི་པ་ཉིད་ལ་འཇུག་ཅིང་མཐར་ལྟ་བ་སེལ་བ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། རྟག་པ་དང་ཆད་པར་ལྟ་བ་ཡོངས་སུ་སྤོང་བའི་ཕྱིར་རོ།
en: Understanding this conditionality and eliminating extreme views are veneration of the Thus-Gone One because they eliminate the views of eternalism and nihilism.

source: །མ་བྱུང་བ་དང་མ་སྐྱེས་པར་བཟོད་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ཏེ། རང་བཞིན་གྱིས་མ་བྱུང་བའི་ཕྱིར་རོ།
en: Acceptance of the nonarising and unborn is veneration of the Thus-Gone One because they are by nature unarisen.

source: །ཀླུའི་བདག་པོ་དེ་ལྟར་ན་ལུས་དང་ངག་དང་སེམས་ཀྱི་རྩོམ་པ་གང་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡོངས་སུ་དག་པ་མ་ཡིན་གྱི།
en: In this way, Nāga Lord, contrivances of body, speech, and mind are not pure veneration of the Thus-Gone One.

source: གང་ན་ལུས་དང་ངག་དང་སེམས་ཀྱི་རྩོམ་པ་མེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: However, where there is no contrivance of body, speech, and mind, that is pure veneration of the Thus-Gone One.
